import 'package:spoonfeed_customer/models/dish.dart';
import 'package:spoonfeed_customer/models/dish_category.dart';

class DishApi {
  Future<List<DishCategory>> getDishCategories(int facilityId) async {
    return [
      DishCategory(1, "Lunch boxes", await _getDish(1)),
      DishCategory(2, "Burgers", await _getDish(2)),
    ];
  }

  Future<List<Dish>> _getDish(int categoryId) async {
    if (categoryId == 1) {
      return [
        Dish(
          1,
          "Боксмайстер Ланчбокс",
          98.99,
          20,
          78.99,
          "Боксмайстер (оригінальний/гострий) + картопля фрі маленька",
        ),
        Dish(
          2,
          "Грандер Бургер Ланчбокс",
          98.99,
          20,
          78.99,
          "Грандер Бургер (оригінальний/гострий) + картопля фрі маленька",
        ),
        Dish(
          3,
          "Сандерс Бургер Ланчбокс",
          98.99,
          20,
          78.99,
          "Сандерс бургер(Класік/Зінгер) + картопля фрі маленька",
        ),
        Dish(
          4,
          "Ай-твістер Сирний Ланчбокс",
          98.99,
          20,
          78.99,
          "Ай-твістер + картопля фрі маленька + 4 нагетси/2 стріпси",
        ),
        Dish(
          5,
          "Чізбургер Ланчбокс",
          98.99,
          20,
          78.99,
          "Чізбургер + картопля фрі маленька + 4 нагетси/2 стріпси (оригінальні/гострі)",
        ),
        Dish(
          6,
          "Твістер Ланчбокс",
          98.99,
          20,
          78.99,
          "Твістер (оригінальний/гострий) + картопля фрі маленька + 4 нагетси/2 стріпси",
        ),
      ];
    } else {
      return [
        Dish(
          7,
          "ДАБЛ ЧІКЕН БАРБЕКЮ ОРИГІНАЛЬНИЙ",
          98.99,
          20,
          78.99,
          "Два соковитих оригінальних шматки курячого філе",
        ),
        Dish(
          8,
          "Тауер Бургер Оригінальний",
          98.99,
          20,
          78.99,
          "Філе в оригінальній паніровці, салат Айсберг з майонезом та кетчупом",
        ),
        Dish(
          9,
          "Шефбургер Оригінальний",
          98.99,
          20,
          78.99,
          "Куряче філе в оригінальній паніровці, соус Гамбургер",
        ),
        Dish(
          10,
          "Сандерс Класік",
          98.99,
          20,
          78.99,
          "Філе в оригінальній паніровці, салат Айсберг з майонезом на пшеничній булочці ",
        ),
        Dish(
          11,
          "Чізбургер",
          98.99,
          20,
          78.99,
          "Стріпс в оригінальній паніровці, сир, кетчуп, гірчиця, огірки з пшеничною булочкою ",
        ),
        Dish(
          12,
          "Тост 2 сира",
          98.99,
          20,
          78.99,
          "Тост з двома скибочками ніжного сиру на смаженій булочці",
        ),
      ];
    }
  }
}
